{
    "steps": [
        {
            "title": "Welcome to Your Language Learning Journey! 🎉",
            "content": "Let's take a quick tour to help you master this powerful translation and vocabulary building tool. This tour will show you all the key features in just a few minutes!",
            "position": "center",
            "highlight": null
        },
        {
            "title": "Language Selection Hub",
            "content": "Start here! Click the left dropdown to choose your source language (Finnish, Korean, Chinese, Vietnamese, Greek). The arrow shows translation direction - always ending in English for now.",
            "position": "bottom-center",
            "highlight": "translation-bar"
        },
        {
            "title": "Smart Text Input Area",
            "content": "Enter any sentence or phrase here. Pro tip: Complete sentences give better context and more accurate translations. Use the Speak button to hear pronunciation!",
            "position": "top-center",
            "highlight": "input-bar"
        },
        {
            "title": "Beautiful Translation Display",
            "content": "Your translated text appears here in an elegant, easy-to-read format. Perfect for quick reference, studying, or sharing with others!",
            "position": "top-center",
            "highlight": "translation"
        },
        {
            "title": "Interactive Word Analysis",
            "content": "This is where the magic happens! Every word gets categorized (verbs, nouns, adjectives, etc.). Click any word to see pronunciation, detailed explanations, and save it to your vocabulary deck!",
            "position": "top-center",
            "highlight": "word-details"
        },
        {
            "title": "Your Personal Profile Center",
            "content": "Register or log in here to unlock the full power of the app. Save your vocabulary, track progress, create custom decks, and sync across devices. Your learning journey starts here!",
            "position": "left",
            "highlight": "user-section"
        },
        {
            "title": "Vocabulary Deck Management",
            "content": "Your flashcard decks live here! See progress percentages, card counts, creation dates, and quick access to detailed views. Perfect for tracking your learning journey across different languages.",
            "position": "left",
            "highlight": "deck-info"
        },
        {
            "title": "You're Ready to Master Languages! 🚀",
            "content": "That's the complete tour! Start by selecting a language and typing your first sentence. Every word you translate can become part of your personal vocabulary collection. Ready to become fluent?",
            "position": "center",
            "highlight": null
        }
    ]
}